//CB7JOB   JOB (ACCT),'CB7 BATCH',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//JOBLIB   DD  DSN=CB7.LOAD,DISP=SHR
//* 
//* STEP01 - Valida os arquivos de entrada
//STEP01   EXEC PGM=CB7VALID
//CLIENTES DD  DSN=CB7.BANK.CLIENTES,DISP=SHR,
//             DCB=(RECFM=FB,LRECL=92,BLKSIZE=0)
//CONTAS   DD  DSN=CB7.BANK.CONTAS,DISP=SHR,
//             DCB=(RECFM=FB,LRECL=48,BLKSIZE=0)
//TRANSIN  DD  DSN=CB7.BANK.TRANSACOES,DISP=SHR,
//             DCB=(RECFM=FB,LRECL=34,BLKSIZE=0)
//VALIDOUT DD  SYSOUT=*
//*
//* STEP02 - Processa as transacoes quando STEP01 terminar com RC=0
//STEP02   EXEC PGM=CB7BATCH,COND=(0,NE,STEP01)
//CLIENTES DD  DSN=CB7.BANK.CLIENTES,DISP=SHR,
//             DCB=(RECFM=FB,LRECL=92,BLKSIZE=0)
//CONTAS   DD  DSN=CB7.BANK.CONTAS,DISP=SHR,
//             DCB=(RECFM=FB,LRECL=48,BLKSIZE=0)
//TRANSIN  DD  DSN=CB7.BANK.TRANSACOES,DISP=SHR,
//             DCB=(RECFM=FB,LRECL=34,BLKSIZE=0)
//CTASOUT  DD  DSN=CB7.BANK.CONTAS.ATUALIZADAS,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(1,1),RLSE),
//             DCB=(RECFM=FB,LRECL=48,BLKSIZE=0)
//TRANOUT  DD  DSN=CB7.BANK.TRANSACOES.PROCESSADAS,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(1,1),RLSE),
//             DCB=(RECFM=FB,LRECL=88,BLKSIZE=0)
//SYSOUT   DD  SYSOUT=*
//*
//* STEP03 - Gera o relatorio quando STEP01 e STEP02 terminarem com RC=0
//STEP03   EXEC PGM=CB7RELAT,
//             COND=((0,NE,STEP01),(0,NE,STEP02))
//CTASIN   DD  DSN=CB7.BANK.CONTAS.ATUALIZADAS,DISP=SHR,
//             DCB=(RECFM=FB,LRECL=48,BLKSIZE=0)
//TRANIN   DD  DSN=CB7.BANK.TRANSACOES.PROCESSADAS,DISP=SHR,
//             DCB=(RECFM=FB,LRECL=88,BLKSIZE=0)
//RELAT    DD  DSN=CB7.BANK.RELATORIO,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(1,1),RLSE),
//             DCB=(RECFM=FB,LRECL=76,BLKSIZE=0)
//SYSOUT   DD  SYSOUT=*
